src/Catalogs/МаппингПолейЗагрузкиДанныхИзВнешнегоИсточника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>МаппингПолейЗагрузкиДанныхИзВнешнегоИсточника</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЗагрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МаппингПолей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерКолонки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныйРеквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/МаппингПолейЗагрузкиДанныхИзВнешнегоИсточника/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции	
	
Функция ВладелецДополнительныхРеквизитовПоПолномуИмени(ПолноеИмя)
	
	Если СтрНайти(ПолноеИмя, "Справочник.КонтактныеЛица") > 0 Тогда
		
		Возврат Справочники.НаборыСвойств.Справочник_КонтактныеЛица;
		
	ИначеЕсли СтрНайти(ПолноеИмя, "Справочник.Контрагенты") > 0 Тогда
		
		Возврат Справочники.НаборыСвойств.Справочник_Контрагенты;
		
	ИначеЕсли СтрНайти(ПолноеИмя, "Справочник.Лиды") > 0 Тогда
		
		Возврат Справочники.НаборыСвойств.Справочник_Лиды;
		
	ИначеЕсли СтрНайти(ПолноеИмя, "Справочник.Номенклатура") > 0 Тогда
		
		Возврат Справочники.НаборыСвойств.Справочник_Номенклатура;
		
	ИначеЕсли СтрНайти(ПолноеИмя, "Справочник.ХарактеристикиНоменклатуры") > 0 Тогда
		
		Возврат Справочники.НаборыСвойств.Справочник_ХарактеристикиНоменклатуры;
		
	ИначеЕсли СтрНайти(ПолноеИмя, "Справочник.Спецификации") > 0 Тогда
		
		Возврат Справочники.НаборыСвойств.Справочник_Спецификации;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

Функция ДоступныеПоляЗагрузкиДанныхИзВнешнегоИсточника(ОбъектЗагрузки, ИмяТабличнойЧасти = "", ВключаяДополнительныеРеквизиты = Ложь, ПолноеИмяОбъектаЗаполнения = "") Экспорт
	Перем ТаблицаПолейЗагрузки;
	
	ДоступныеПоляЗагрузкиДанных = Новый Структура;
	Если НЕ ЗначениеЗаполнено(ОбъектЗагрузки) Тогда
		
		Возврат ДоступныеПоляЗагрузкиДанных;
		
	КонецЕсли;
	
	НастройкиЗагрузкиДанных = Новый Структура;
	НастройкиЗагрузкиДанных.Вставить("СодержаниеВидимо", НЕ ПустаяСтрока(ИмяТабличнойЧасти));
	НастройкиЗагрузкиДанных.Вставить("ПолноеИмяОбъектаЗаполнения", ПолноеИмяОбъектаЗаполнения);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.СоздатьТаблицуПолейОписанияЗагрузки(ТаблицаПолейЗагрузки);
	
	МенеджерОбъектаЗагрузки = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ОбъектЗагрузки.ПолноеИмя);
	МенеджерОбъектаЗагрузки.ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных);
	
	Для каждого СтрокаТаблицы Из ТаблицаПолейЗагрузки Цикл
		
		Если СтрокаТаблицы.ИмяПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяПоляДобавленияДополнительныхРеквизитов() Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ДоступныеПоляЗагрузкиДанных.Вставить(СтрокаТаблицы.ИмяПоля, СтрокаТаблицы.ПредставлениеПоля);
		
	КонецЦикла;
	
	Если ВключаяДополнительныеРеквизиты Тогда
		
		Владелец = ВладелецДополнительныхРеквизитовПоПолномуИмени(ОбъектЗагрузки.ПолноеИмя);
		Если Владелец <> Неопределено Тогда
			
			ЗагрузкаДанныхИзВнешнегоИсточника.ПодготовитьСоответствиеПоДополнительнымРеквизитам(НастройкиЗагрузкиДанных, Владелец);
			
			Для каждого ЭлементСоответствия Из НастройкиЗагрузкиДанных.ОписаниеДополнительныхРеквизитов Цикл
				
				ДоступныеПоляЗагрузкиДанных.Вставить(ЭлементСоответствия.Значение, ЭлементСоответствия.Ключ);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДоступныеПоляЗагрузкиДанных;
	
КонецФункции

#КонецОбласти

#КонецЕсли
